# -*- coding: utf-8 -*-

# "祖茂": b'\xfc\x32\x01\x00',

CARD_CODE_PURPLE = {
    "小乔": b'\xb1\x36\x01\x00',
    "吕蒙": b'\xf5\x32\x01\x00',
    "张辽": b'\xcc\x32\x01\x00',
}

CARD_CODE_GOLD = {
    "曹操": b"\xfa\x2a\x01\x00",
    "典韦": b"\x06\x2b\x01\x00",
    "王异": b"\x0b\x2b\x01\x00",
    "许褚": b"\xe3\x2e\x01\x00",
    "张郃": b"\xf4\x2e\x01\x00",
    "夏侯渊": b"\xd0\x32\x01\x00",
    "徐晃": b"\xd1\x32\x01\x00",
    "神速张辽": b"\xd7\x32\x01\x00",
    "曹仁": b"\xda\x32\x01\x00",
    "庞德": b"\xde\x32\x01\x00",
    "夏侯惇": b"\xe0\x32\x01\x00",
    "贾诩": b"\xb9\x36\x01\x00",
    "卞夫人": b"\xbe\x36\x01\x00",
    "曹丕": b"\xc0\x36\x01\x00",
    "曹植": b"\xc3\x36\x01\x00",
    "程昱": b"\xc5\x36\x01\x00",
    "郭嘉": b"\xc7\x36\x01\x00",
    "荀彧": b"\xcf\x36\x01\x00",
    "鬼神关羽": b"\x0c\x37\x01\x00",
    "刘备": b"\xf9\x2a\x01\x00",
    "赵云": b"\xe1\x2e\x01\x00",
    "张飞": b"\xed\x2e\x01\x00",
    "关平": b"\xf7\x2e\x01\x00",
    "关银屏": b"\xf8\x2e\x01\x00",
    "魏延": b"\xfe\x2e\x01\x00",
    "关羽": b"\xca\x32\x01\x00",
    "马超": b"\xea\x32\x01\x00",
    "马姬": b"\xed\x32\x01\x00",
    "严颜": b"\xf0\x32\x01\x00",
    "诸葛亮": b"\xb3\x36\x01\x00",
    "甘皇后": b"\xd7\x36\x01\x00",
    "黄月英": b"\xd9\x36\x01\x00",
    "黄忠": b"\xdb\x36\x01\x00",
    "庞统": b"\xde\x36\x01\x00",
    "徐庶": b"\xe2\x36\x01\x00",
    "枭姬尚香": b"\xe7\x36\x01\x00",
    "孙策": b"\xff\x2a\x01\x00",
    "大乔": b"\x1c\x2b\x01\x00",
    "文鸯": b"\x25\x2b\x01\x00",
    "甘宁": b"\xe2\x2e\x01\x00",
    "凌统": b"\x04\x2f\x01\x00",
    "孙尚香": b"\x09\x2f\x01\x00",
    "周泰": b"\x0b\x2f\x01\x00",
    "孙坚": b"\xf8\x32\x01\x00",
    "周瑜": b"\xb2\x36\x01\x00",
    "太史慈": b"\xb7\x36\x01\x00",
    "祝小乔": b"\xbc\x36\x01\x00",
    "刚弓吕蒙": b"\xda\x36\x01\x00",
    "鲁肃": b"\xeb\x36\x01\x00",
    "吴夫人": b"\xef\x36\x01\x00",
    "徐夫人": b"\xf1\x36\x01\x00",
    "张昭": b"\xf4\x36\x01\x00",
    "董卓": b"\x00\x2b\x01\x00",
    "张角": b"\x05\x2b\x01\x00",
    "文丑": b"\xeb\x2e\x01\x00",
    "颜良": b"\xec\x2e\x01\x00",
    "袁绍": b"\x18\x2f\x01\x00",
    "吕布": b"\xc9\x32\x01\x00",
    "董白": b"\xd3\x32\x01\x00",
    "高顺": b"\xff\x32\x01\x00",
    "貂蝉": b"\xb8\x36\x01\x00",
    "陈宫": b"\xf7\x36\x01\x00",
    "疾风赵云": b"\xf8\x36\x01\x00",
    "吕姬": b"\xf9\x36\x01\x00",
    "蔡文姬": b"\xff\x36\x01\x00",
    "郭图": b"\x03\x37\x01\x00",
    "审配": b"\x08\x37\x01\x00",
    "田丰": b"\x0b\x37\x01\x00",
    "张任": b"\x10\x37\x01\x00",
    "甄洛": b"\x12\x37\x01\x00",
}

STACK_ABLES = dict(
    bind_gold=b"\x5c\x01\x02",
    fresh_card=b"\x20\x64\x00",
    gold_wine=b"\x5c\x01\x12",
)

__SERVER_LIST = [{'id': 1, 'ip': '128.14.236.13', 'state': 1, 'name': '三國霸業', 'order_number': 1, 'port': 30000}, {'id': 2, 'ip': '128.14.236.13', 'state': 1, 'name': '金戈劍雨', 'order_number': 2, 'port': 30000}, {'id': 3, 'ip': '128.14.236.13', 'state': 1, 'name': '虎嘯龍吟', 'order_number': 3, 'port': 30000}, {'id': 4, 'ip': '128.14.236.13', 'state': 1, 'name': '鐵馬冰河', 'order_number': 4, 'port': 30000}, {'id': 5, 'ip': '128.14.236.13', 'state': 1, 'name': '風聲鶴唳', 'order_number': 5, 'port': 30000}, {'id': 6, 'ip': '128.14.236.13', 'state': 1, 'name': '亂石穿空', 'order_number': 6, 'port': 30000}, {'id': 7, 'ip': '128.14.236.13', 'state': 1, 'name': '飛龍在天', 'order_number': 7, 'port': 30000}, {'id': 8, 'ip': '128.14.236.13', 'state': 1, 'name': '大浪淘沙', 'order_number': 8, 'port': 30000}, {'id': 9, 'ip': '103.98.17.254', 'state': 1, 'name': '臥龍鳳雛', 'order_number': 9, 'port': 30000}, {'id': 10, 'ip': '103.98.17.254', 'state': 1, 'name': '星月交輝', 'order_number': 10, 'port': 30000}, {'id': 11, 'ip': '103.98.17.254', 'state': 1, 'name': '對酒當歌', 'order_number': 11, 'port': 30000}, {'id': 12, 'ip': '103.98.17.254', 'state': 1, 'name': '虎踞龍盤', 'order_number': 12, 'port': 30000}, {'id': 13, 'ip': '103.98.17.254', 'state': 1, 'name': '群雄逐鹿', 'order_number': 13, 'port': 30000}, {'id': 14, 'ip': '103.98.17.254', 'state': 1, 'name': '君臨天下', 'order_number': 14, 'port': 30000}, {'id': 15, 'ip': '103.98.17.254', 'state': 1, 'name': '臥虎藏龍', 'order_number': 15, 'port': 30000}, {'id': 16, 'ip': '103.98.17.254', 'state': 1, 'name': '驚濤拍岸', 'order_number': 16, 'port': 30000}, {'id': 17, 'ip': '128.14.236.45', 'state': 1, 'name': '其疾如風', 'order_number': 17, 'port': 30000}, {'id': 18, 'ip': '128.14.236.45', 'state': 1, 'name': '狼煙四起', 'order_number': 18, 'port': 30000}, {'id': 19, 'ip': '128.14.236.49', 'state': 1, 'name': '沃野千里', 'order_number': 19, 'port': 30000}, {'id': 20, 'ip': '128.14.230.246', 'state': 1, 'name': '石破天驚', 'order_number': 20, 'port': 30000}]
SERVER_LIST = dict()
for srv in __SERVER_LIST:
    SERVER_LIST[srv['id']] = (srv['id'], srv['ip'], srv['port'])

GUILD_ID = {
    20: b"\x00\x00\x00\x0b\x00\x09\x00\x00\x00\x00\x2b\x02\x00\x00\x00",
    18: b"\x00\x00\x00\x0b\x00\x09\x00\x00\x00\x00\x2b\x81\x00\x00\x00",
}

__EPISODES = ["""
              初入乱世
              初战黄巾 1-1
              应召入伍
              再战黄巾 1-2
              回禀何进
              同门相聚
              志同道合
              桃园三杰
              整备兵马
              并肩作战 1-3
              初遇孙坚
              增援长社
              解围长社 1-4
              初遇曹操
              黄巾之末 1-5
              窃取胜利
              师父消息
              """,
              """
              诸侯会合
              关东盟主
              首战汜水 2-1
              继续攻城 2-2
              孙坚受伤
              河北上将
              兵败华雄 2-3
              重振军威
              再战华雄 2-4
              勇冠三军
              并州狼骑 2-5
              作战会议
              张辽文远 2-6
              攻破汜水
              """,
              """
              主动请命
              邀刘同行
              先锋用意
              与曹联合
              继续进军 3-1
              闯关斩将 3-2
              势如破竹 3-3
              初遇吕姬 3-4
              飞将驰援
              进攻虎牢
              初战虎牢 3-5
              回援公孙 3-6
              智退李儒 3-7
              三杰救场
              天下无双 3-8
              出击洛阳
              """,
              """
              计划追击
              联盟裂痕
              星星之火
              同门决裂
              江东之虎
              追击董卓
              蔡邕消息 4-1
              文姬救父 4-2
              继续追击 4-3
              遭遇伏击 4-4
              杀出重围 4-5
              重整旗鼓
              再次出击 4-6
              袭击董军 4-7
              激战董卓 4-8
              文姬失散
              """,
              """
              狼狈回归
              曹操离开
              国之重器
              撤回江东
              袁军追击 5-1
              突破阻拦 5-2
              穷追不舍 5-3
              大将麹义
              大破先登 5-4
              绕道荆州 5-5
              荆军阻挠 5-6
              智败蒯越 5-7
              趁机突围
              """]

EPISODES = list(item.strip().split("\n") for item in __EPISODES)


LAST_NAME = ["趙","錢","孫","李","周","吳","鄭","王","馮","陳","褚","衛","蔣","沈","韓","楊","朱","秦","尤","許","何","呂","施","張","孔","曹","嚴","華","金","魏","陶","姜","戚","謝","鄒","喻","柏","水","竇","章","雲","蘇","潘","葛","奚","範","彭","郎","魯","韋","昌","馬","苗","鳳","花","方","俞","任","袁","柳","酆","鮑","史","唐","費","廉","岑","薛","雷","賀","倪","湯","滕","殷","羅","畢","郝","鄔","安","常","樂","於","時","傅","皮","卞","齊","康","伍","余","元","蔔","顧","孟","平","黃","和","穆","蕭","尹","姚","邵","湛","汪","祁","毛","禹","狄","米","貝","明","臧","計","伏","成","戴","談","宋","茅","龐","熊","紀","舒","屈","項","祝","董","梁","杜","阮","藍","閔","席","季","麻","強","賈","路","婁","危","江","童","顏","郭","梅","盛","林","刁","鐘","丘","徐","邱","駱","高","夏","蔡","田","樊","胡","淩","霍","虞","萬","支","柯","昝","管","盧","莫","經","房","裘","繆","幹","解","應","宗","丁","宣","賁","鄧","單","杭","洪","包","諸","左","石","崔","吉","鈕","龔","程","嵇","邢","滑","裴","陸","榮","翁","荀","羊","於","惠","甄","曲","家","封","芮","羿","儲","靳","汲","邴","糜","松","井","段","富","巫","烏","焦","巴","弓","牧","隗","山","谷","車","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宮","寧","仇","欒","暴","甘","鈄","厲","戎","祖","武","符","劉","景","詹","束","龍","葉","幸","司","韶","郜","黎","薊","薄","印","宿","白","懷","蒲","臺","從","鄂","索","鹹","籍","賴","卓","藺","屠","蒙","池","喬","陰","郁","胥","能","蒼","雙","聞","莘","黨","翟","譚","貢","勞","逢","逄","姬","申","扶","堵","冉","宰","酈","雍","郤","璩","桑","桂","濮","牛","壽","通","邊","扈","燕","冀","郟","浦","尚","農","溫","別","莊","晏","柴","瞿","閻","充","慕","連","茹","習","宦","艾","魚","容","向","古","易","慎","戈","廖","庚","終","暨","居","衡","步","都","耿","滿","弘","匡","國","文","寇","廣","祿","闕","東","歐","殳","沃","利","蔚","越","夔","隆","師","鞏","厙","聶","晁","勾","敖","融","冷","訾","辛","闞","那","簡","饒","空","曾","毋","沙","乜","養","鞠","須","豐","巢","關","蒯","相","查","荊","紅","遊","竺","權","逯","蓋","益","桓","公","萬俟","司馬","上官","歐陽","夏侯","諸葛","聞人","東方","赫連","皇甫","尉遲","公羊","淡臺","公冶","宗政","濮陽","淳於","單於","太叔","申屠","公孫","仲孫","軒轅","令狐","鐘離","宇文","長孫","慕容","鮮於","閭丘","司徒","司空","亓官","司寇","仉督","子車","顓孫","端木","巫馬","公西","漆雕","樂正","壤駟","公良","拓拔","夾谷","宰父","谷粱","晉","楚","閻","法","汝","鄢","塗","欽","段幹","百裏","東郭","南門","呼延","歸","海","羊舌","微生","嶽","帥","緱","亢","況","後","有","琴","梁丘","左丘","東門","西門","商","牟","佘","佴","伯","賞","南宮","墨","哈","譙","笪","年","愛","陽","佟","言","福"]
BOY_NAME = ["辰逸","浩宇","瑾瑜","皓軒","峻熙","嘉懿","煜城","懿軒","燁華","煜祺","智宸","正豪","昊然","胤祥","瑞霖","明哲","天翊","凱瑞","健雄","耀傑","瀟然","子涵","宇彬","宇軒","誌澤","明傑","弘文","燁偉","明哲","天佑","英傑","致遠","俊馳","智輝","辰逸","浩宇","瑾瑜","皓軒","擎蒼","擎宇","致遠","燁磊","智輝","辰逸","皓軒","苑博","鵬濤","炎彬","鶴軒","偉澤","君昊","熠彤","鴻煊","聖傑","俊楠","鴻濤","偉祺","博濤","苑傑","黎昕","燁霖","哲瀚","雨澤","瀟然","子涵","天翊","凱瑞","健雄","致遠","燁磊","楷瑞","建輝","致遠","俊馳","雨澤","燁磊","國豪","偉奇","文博","天佑","文昊","修傑","晟睿","文博","燁磊","偉奇","浩宇","文博","天佑","文昊","旭堯","英傑","聖傑","鑫鵬","俊楠","鴻濤","偉祺","榮軒","浩宇","瑾瑜","胤祥","瑞霖","晟睿","修潔","黎昕","遠航","旭堯","聖傑","炎彬","鶴軒","越彬","風華","靖琪","明輝","越澤","智輝","辰逸","浩宇","瑾瑜","皓軒","俊楠","越澤","耀傑","鴻濤","偉祺","榮軒","宇彬","宇軒"]
GIRL_NAME = ["茹珺","雲舒","珺睿","惠雅","珺菡","安娜","媛娜","惠睿","晴茜","嵐嫦","雲涵","晴惠","怡翎","裕梅","涵惠","惠絮","涵菡","雯婷","寒淑","潤潔","秉文","晴清","淑涵","珺涵","雲華","舒媛","素婭","花曼","嵐雅","清華","寒菊","涵茵","嵐菡","欣琳","熙玉","嵐菲","寒雲","茹絮","寒媛","嵐瑜","正妍","琳竣","淑淑","惠語","寒華","涵婷","晴珺","妍如","榕嫣","寒瑜","雲嫦","茵清","茵嫣","惠雲","潔玲","雨蓉","翔雯","淑夢","晴菡","珺雲","清雅","梓婧","雯婧","雯嘉","雯舒","茜菡","雲嫣","清夢","秀珊","欣怡","惠茜","茜華","茜茜","舒菲","婷雯","曉悅","芷秀","欣瑤","曦秀","婷麗","莉娜","東玲","巧娜","佳艷","秀秀","新穎","依娜","欣瑤","夢潔","菁茹","澤芳","怡若","陳紅","婧寧","美怡","悅帆","瑩瑩","莉綾","德梅","燕萍","瑛蔓","鶴梅","蓉華","佳莉","蔡琳","婧妍","斯玉","愷玲","珂妍","小莉","成美","倩冰","優美","長麗","瑜文","姝瑤","春穎","華琳","妍婷","娉娟","燕艷","妍青","靜美","禾悅","妍淩","惋潔","清嘉","茜媛","涵茹","惠晴","茵惠","嵐雁","茜菲","媛菲","珺綺","茹菲","涵嫣","翔鳴","雨花","思艷","寒嵐","茜嫦","茜菊","涵媛","淑雲","辰蓉","貞穎","舒嫣","清雲","茵萍","淑華","媛語","琳爰","君茹","雲晴","寒鳴","雲清","嵐華","淑惠","顏英","真文","雯語","晴茹","雯晴","雯睿","清茜","青蓉","妍羽","芬迎","恬梨","芙婕","宸旋","翾琳","麗霞","悅淇","桐卿","宸英芳梨","銘倩","睿琳","莉娉","純雪","仲媛","湘怡","怡丞","秀琴","滇萍","薇穎","媛媛","映蓉","長英","麗美","夕文","琳涵","燕星","善玲","琴子","筱雪","旭妍","蠑婷","怡婷","莉穎","芹悅","翔嘉","晴嵐","晴翠","雅舒","茹語","若美","婭清","翔媛","惠嘉","雲絮","茹雲","雯翔","寒睿","舒玉","雅淑","雯嫣","嵐茹","雯淑","茜雲","寒嫣","涵綺","晴睿","茜夢","雲菡","嵐萍","茵雅","莉萍","夢麗","涵菲","茵茹","晴茵","嵐婷","涵語","雯瑛","惠淑","寒雁","淑雅","嵐舒","婷雯","梓悅","秀娟","瑤華","芝蓉","婭庭","樹艷","小霞","廈潔","卷玉","欣穎","世悅","艷蓉","丹潔","玲嬌","卓妍","杭英","玲麗","睿穎","煒琳","雨瑩","煒婷","麗英","忠燕","瑞芬","婧文","惠芳","炎琳","秀穎","翠萍","愛茹","艷霞","龍艷","嫣鈺","誌芳","芷茹","悅穎","紅英","焱霞","婷秀","惠玲","於娜","沁媛","諾瑤","梓燕","秀君","昊怡","小妍","悅張","秀芳","欣怡","曉梅","午瑤","會霞","龍梅","琳敏","展文","羽瑩","藝萍","月玲","歌玲","海燕","晶婧","尤文","儀琳","玉娟","鈺潔","雪娟","卿蓉","曉潔","家穎","安茹","湘媛","丹梅","薏冉","婷昱","怡可","琳渺","卓婷","瓶花","愛萍","桂燕","石英","臘梅","雅莉","莉婭","娟娣","艷紅","棠莉","悅馳","婉婷","嘉潔","彩紅","媛雪","美芳","莉軒","燕齊","昕妍","倡文","紊文","子婧","愛琴","維娟","思娜","振文","鸞瑤","玲麗","旦婭","蘇娟","羽潔","秋艷","建穎","泓茹","富霞","倩成","詩茹","承文","雪芬","妍玲","曉霞","依婷","瑾琳","永琴","翰穎","婉燕","景文","賽玉","曉玉","晉玉","幸瑤","歆琳","曾燕","國政","彩娟","三婷","雪婧","義文","雪萍","津文","琳秀","燕明","純潔","素莉","艷玲"]
