# -*- coding: utf-8 -*-

# "祖茂": b'\xfc\x32\x01\x00',

CARD_CODE_PURPLE = {
    "小乔": b'\xb1\x36\x01\x00',
    "吕蒙": b'\xf5\x32\x01\x00',
    "张辽": b'\xcc\x32\x01\x00',
}

CARD_CODE_GOLD = {
    "曹操": b"\xfa\x2a\x01\x00",
    "典韦": b"\x06\x2b\x01\x00",
    "王异": b"\x0b\x2b\x01\x00",
    "许褚": b"\xe3\x2e\x01\x00",
    "张郃": b"\xf4\x2e\x01\x00",
    "夏侯渊": b"\xd0\x32\x01\x00",
    "徐晃": b"\xd1\x32\x01\x00",
    "神速张辽": b"\xd7\x32\x01\x00",
    "曹仁": b"\xda\x32\x01\x00",
    "庞德": b"\xde\x32\x01\x00",
    "夏侯惇": b"\xe0\x32\x01\x00",
    "贾诩": b"\xb9\x36\x01\x00",
    "卞夫人": b"\xbe\x36\x01\x00",
    "曹丕": b"\xc0\x36\x01\x00",
    "曹植": b"\xc3\x36\x01\x00",
    "程昱": b"\xc5\x36\x01\x00",
    "郭嘉": b"\xc7\x36\x01\x00",
    "荀彧": b"\xcf\x36\x01\x00",
    "鬼神关羽": b"\x0c\x37\x01\x00",
    "刘备": b"\xf9\x2a\x01\x00",
    "赵云": b"\xe1\x2e\x01\x00",
    "张飞": b"\xed\x2e\x01\x00",
    "关平": b"\xf7\x2e\x01\x00",
    "关银屏": b"\xf8\x2e\x01\x00",
    "魏延": b"\xfe\x2e\x01\x00",
    "关羽": b"\xca\x32\x01\x00",
    "马超": b"\xea\x32\x01\x00",
    "马姬": b"\xed\x32\x01\x00",
    "严颜": b"\xf0\x32\x01\x00",
    "诸葛亮": b"\xb3\x36\x01\x00",
    "甘皇后": b"\xd7\x36\x01\x00",
    "黄月英": b"\xd9\x36\x01\x00",
    "黄忠": b"\xdb\x36\x01\x00",
    "庞统": b"\xde\x36\x01\x00",
    "徐庶": b"\xe2\x36\x01\x00",
    "枭姬尚香": b"\xe7\x36\x01\x00",
    "孙策": b"\xff\x2a\x01\x00",
    "大乔": b"\x1c\x2b\x01\x00",
    "文鸯": b"\x25\x2b\x01\x00",
    "甘宁": b"\xe2\x2e\x01\x00",
    "凌统": b"\x04\x2f\x01\x00",
    "孙尚香": b"\x09\x2f\x01\x00",
    "周泰": b"\x0b\x2f\x01\x00",
    "孙坚": b"\xf8\x32\x01\x00",
    "周瑜": b"\xb2\x36\x01\x00",
    "太史慈": b"\xb7\x36\x01\x00",
    "祝小乔": b"\xbc\x36\x01\x00",
    "刚弓吕蒙": b"\xda\x36\x01\x00",
    "鲁肃": b"\xeb\x36\x01\x00",
    "吴夫人": b"\xef\x36\x01\x00",
    "徐夫人": b"\xf1\x36\x01\x00",
    "张昭": b"\xf4\x36\x01\x00",
    "董卓": b"\x00\x2b\x01\x00",
    "张角": b"\x05\x2b\x01\x00",
    "文丑": b"\xeb\x2e\x01\x00",
    "颜良": b"\xec\x2e\x01\x00",
    "袁绍": b"\x18\x2f\x01\x00",
    "吕布": b"\xc9\x32\x01\x00",
    "董白": b"\xd3\x32\x01\x00",
    "高顺": b"\xff\x32\x01\x00",
    "貂蝉": b"\xb8\x36\x01\x00",
    "陈宫": b"\xf7\x36\x01\x00",
    "疾风赵云": b"\xf8\x36\x01\x00",
    "吕姬": b"\xf9\x36\x01\x00",
    "蔡文姬": b"\xff\x36\x01\x00",
    "郭图": b"\x03\x37\x01\x00",
    "审配": b"\x08\x37\x01\x00",
    "田丰": b"\x0b\x37\x01\x00",
    "张任": b"\x10\x37\x01\x00",
    "甄洛": b"\x12\x37\x01\x00",
}

STACK_ABLES = dict(
    bind_gold=b"\x5c\x01\x02",
    fresh_card=b"\x20\x64\x00",
    gold_wine=b"\x5c\x01\x12",
)

__SERVER_LIST = [{'id': 1, 'ip': '128.14.236.13', 'state': 1, 'name': '三國霸業', 'order_number': 1, 'port': 30000}, {'id': 2, 'ip': '128.14.236.13', 'state': 1, 'name': '金戈劍雨', 'order_number': 2, 'port': 30000}, {'id': 3, 'ip': '128.14.236.13', 'state': 1, 'name': '虎嘯龍吟', 'order_number': 3, 'port': 30000}, {'id': 4, 'ip': '128.14.236.13', 'state': 1, 'name': '鐵馬冰河', 'order_number': 4, 'port': 30000}, {'id': 5, 'ip': '128.14.236.13', 'state': 1, 'name': '風聲鶴唳', 'order_number': 5, 'port': 30000}, {'id': 6, 'ip': '128.14.236.13', 'state': 1, 'name': '亂石穿空', 'order_number': 6, 'port': 30000}, {'id': 7, 'ip': '128.14.236.13', 'state': 1, 'name': '飛龍在天', 'order_number': 7, 'port': 30000}, {'id': 8, 'ip': '128.14.236.13', 'state': 1, 'name': '大浪淘沙', 'order_number': 8, 'port': 30000}, {'id': 9, 'ip': '103.98.17.254', 'state': 1, 'name': '臥龍鳳雛', 'order_number': 9, 'port': 30000}, {'id': 10, 'ip': '103.98.17.254', 'state': 1, 'name': '星月交輝', 'order_number': 10, 'port': 30000}, {'id': 11, 'ip': '103.98.17.254', 'state': 1, 'name': '對酒當歌', 'order_number': 11, 'port': 30000}, {'id': 12, 'ip': '103.98.17.254', 'state': 1, 'name': '虎踞龍盤', 'order_number': 12, 'port': 30000}, {'id': 13, 'ip': '103.98.17.254', 'state': 1, 'name': '群雄逐鹿', 'order_number': 13, 'port': 30000}, {'id': 14, 'ip': '103.98.17.254', 'state': 1, 'name': '君臨天下', 'order_number': 14, 'port': 30000}, {'id': 15, 'ip': '103.98.17.254', 'state': 1, 'name': '臥虎藏龍', 'order_number': 15, 'port': 30000}, {'id': 16, 'ip': '103.98.17.254', 'state': 1, 'name': '驚濤拍岸', 'order_number': 16, 'port': 30000}, {'id': 17, 'ip': '128.14.236.45', 'state': 1, 'name': '其疾如風', 'order_number': 17, 'port': 30000}, {'id': 18, 'ip': '128.14.230.114', 'state': 1, 'name': '狼煙四起', 'order_number': 18, 'port': 30000}, {'id': 19, 'ip': '128.14.236.49', 'state': 1, 'name': '沃野千里', 'order_number': 19, 'port': 30000}, {'id': 20, 'ip': '128.14.230.246', 'state': 1, 'name': '石破天驚', 'order_number': 20, 'port': 30000}]
SERVER_LIST = dict()
for srv in __SERVER_LIST:
    SERVER_LIST[srv['id']] = (srv['id'], srv['ip'], srv['port'])

__EPISODES = ["""
              初入乱世
              初战黄巾 1-1
              应召入伍
              再战黄巾 1-2
              回禀何进
              同门相聚
              志同道合
              桃园三杰
              整备兵马
              并肩作战 1-3
              初遇孙坚
              增援长社
              解围长社 1-4
              初遇曹操
              黄巾之末 1-5
              窃取胜利
              师父消息
              """,
              """
              诸侯会合
              关东盟主
              首战汜水 2-1
              继续攻城 2-2
              孙坚受伤
              河北上将
              兵败华雄 2-3
              重振军威
              再战华雄 2-4
              勇冠三军
              并州狼骑 2-5
              作战会议
              张辽文远 2-6
              攻破汜水
              """,
              """
              主动请命
              邀刘同行
              先锋用意
              与曹联合
              继续进军 3-1
              闯关斩将 3-2
              势如破竹 3-3
              初遇吕姬 3-4
              飞将驰援
              进攻虎牢
              初战虎牢 3-5
              回援公孙 3-6
              智退李儒 3-7
              三杰救场
              天下无双 3-8
              出击洛阳
              """,
              """
              计划追击
              联盟裂痕
              星星之火
              同门决裂
              江东之虎
              追击董卓
              蔡邕消息 4-1
              文姬救父 4-2
              继续追击 4-3
              遭遇伏击 4-4
              杀出重围 4-5
              重整旗鼓
              再次出击 4-6
              袭击董军 4-7
              激战董卓 4-8
              文姬失散
              """,
              """
              狼狈回归
              曹操离开
              国之重器
              撤回江东
              袁军追击 5-1
              """]

EPISODES = list(item.strip().split("\n") for item in __EPISODES)
